#+title: Xrandr



#+begin_src bash
xrandr --current
xrandr --listproviders

xrandr --query | grep ' connected'
#+end_src
#+RESULTS:
| Providers: | number    | :       |             1 |         |      |          |         |      |         |        |       |          |   |            |            |   |                  |
| Provider   | 0:        | id:     |          0x46 | cap:    | 0x9, | Source   | Output, | Sink | Offload | crtcs: |     4 | outputs: | 4 | associated | providers: | 0 | name:modesetting |
| eDP-1      | connected | primary | 1920x1200+0+0 | (normal | left | inverted | right   | x    | axis    | y      | axis) | 301mm    | x | 188mm      |            |   |                  |

* Mirror screen example

#+begin_src bash
xrandr --output DP-2 --mode 1920x1080 --same-as DP-1

# scaling the resolution
xrandr --output LVDS-1 --mode 1366x768 --scale 1x1 --output VGA-1 --same-as LVDS-1 --mode 1920x1080 --scale 0.711x0.711
#+end_src
